export const FANTIA_MAPPING = `
c057fdbb	2022年	40	青いベンチ	サスケ
bca6ec0a	2022年	50	ひまわりの約束	秦基博
5396e324	2022年	60	フレンズ	レベッカ
810c8c51	2022年	70	ハイヒールを脱ぎ捨てて	ZARD
8525a684	2022年	80	陽のあたる坂道	Do As Infinity
72b0a6a2	2022年	90	うしろゆびさされ組	うしろゆびさされ組
dd9e1f20	2022年	100	Happy Halloween	Junky
2effa7dc	2022年	110	AIAIAI	キズナアイ
e8db1f7b	2022年	120	クリスマス	JUDY AND MARY
e2ae9c56	2023年	10	友達でいいから	高橋由美子
7facf82e	2023年	20	愛は勝つ	KAN
e0c61c74	2023年	30	可愛くてごめん	HoneyWorks
b21186da	2023年	40	私が恋を知る日	HoneyWorks
14601002	2023年	50	青春コンプレックス	結束バンド
f613c0d5	2023年	60	あなたに会えてよかった	小泉今日子
630afe3c	2023年	70	恋愛サーキュレーション	花澤香菜
5844d699	2023年	80	君たちキウイ・パパイヤ・マンゴーだね。	中原めいこ
9eb89943	2023年	90	secret base ～君がくれたもの～	ZONE
d5880f56	2023年	100	staple stable	戦場ヶ原ひたぎ
95c09aa5	2023年	110	ファッションモンスター	きゃりーぱみゅぱみゅ
c1597444	2023年	120	世界が終わるまでは	WANDS
0d8d715f	2024年	10	世界中の誰よりきっと	中山美紀
1f4df8d7	2024年	20	恋愛サーキュレーション	花澤香菜
558d400f	2024年	30	Answer	SILENT SIREN
76e95e1f	2024年	40	私がオバさんになっても	森高千里
e05128ee	2024年	50	シャルル	須田景凪
3a4723cd	2024年	60	最悪な日でもあなたが好き。	芹澤優
640c3f70	2024年	70	もう少し あと少し	ZARD
82316990	2024年	80	ブルーウォーター	森川美穂
65012111	2024年	90	なぜ...	Hysteric Blue
183147bd	2024年	100	まちぶせ	石川ひとみ
7ae10e48	2024年	110	雨に濡れて	ZARD
ceb78e9e	2024年	120	P.S.I LOVE YOU	PINK SAAPPHIRE
745f2ff4	2025年	10	SWEET MEMORIES	松田聖子
b37e0306	2025年	20	Squall	松本英子
ebf5f23f	2025年	30	チョコレイト・ディスコ	Perfume
662ff084	2025年	40	すみれ September Love	SHAZNA
b12764f9	2025年	50	ライオン	中島愛
974db37b	2025年	60	雨	森高千里
306d7eae	2025年	70	スキマジカン	アネモネ
920db4de	2025年	80	ハレ晴レユカイ	ＳＯＳ団
96ea2b87	2025年	90	ハム太郎とっとこうた	ハムちゃんず
df9c14b9	2025年	91	雨にキッスの花束を	今井美樹
059c5a7f	2025年	100	王子様と雪の夜	タンポポ
7908c3c9	2025年	101	slash	Yama
ab60eda7	2025年	110	赤い日記帳	あか組4
e80c942e	2025年	111	乙女 パスタに感動	タンポポ
`