export const lyrics = {
  "Yume no Tojou": `まだ正夢の途上（とじょう）だよ
とじょみん（キミ）と歩もう この松戸（まち）で

誰かを羨むだけじゃ
未来もそっぽを向いちゃうよ？
逆境も Link up 葛藤も Twinkle
夢には 不可欠なレシピ

こころが雨降りな日も
天然色の空を見よう
アニマルの Link up 綿雲 Twinkle
探せば また元気出るよ

モンダイとか ひとつも起きない
ストリーはナイナイナイ
聴こえてる みんなのその声援（こえ）
だから ぜんぶ越えてゆける
当たり前とか ひとつもない！

まだ正夢の途上（とじょう）だよ
やっと つぼみ つけたの
ほら 花に水 とじょみん（キミ）にキス
夢を咲かそう この松戸（まち）で

ちっばっば 千っ葉っ葉 ちっばっば

「何が起きる？」２１世紀
”なし”くずしじゃ きっとダメ
何が起きても 信じられる
キズナがあれば 大丈夫！

モンダイないよ？ アリガトひとつで
ナミダは いないいないばあっ！
勿体ないよ？ ちゃんと伝えなきゃ
いつもそばで 元気くれる
そのやさしさに 大感謝っ

まだ長旅の途上（とじょう）だよ
空に 虹を懸けていく
迷いながらでも 進んでいこう
とじょみん（キミ）がいれば あきらめない

何度も 泣いても いないいないばあっ！
あしたはできる 大丈夫！

まだ正夢の途上（とじょう）だよ
やっと つぼみ つけたの
ほら 花に水 とじょみん（キミ）にキス
夢を咲かそう この松戸（まち）から

まだ長旅の途上（とじょう）だよ
空に 虹を懸けていく
迷いながらでも 進んでいこう
とじょみん（キミ）がいれば あきらめない

ねえ アリガトじゃ足りないよ
こころ込めて「あいしているわ」`,
  "チバケンサンバ": `-　

CHI-CHI-BA-BA-BA CHI-CHI-CHI-BA-BA-BA
CHI-CHI-BA-BA-BA CHI-CHI-CHI-BA-BA-BA
CHI-CHI-BA-BA-BA はっぴーな世界
やんべー!べー!ベー!やんべー!べー!ベー!ベー!(フー!)

落花生食べながら ビワの電車に揺られ
ひろがる窓の景色かがやけ!千葉の街

鋸山のいただきは ギザギザ
そこで きっとみつかる 夢の場所(ハハッ)

ほこり高くホオジロの歌で飛び出そう

いつでもね ちかくにね
聞こえるよサンバ
チバケンサンバ(おれ!)

魅惑ひろがる甘いコーヒーに サンバのリズムで
宝箱を開けたら 海のホタルとくじらたち ベー!
チバケンサンバ~(オレ!)
(間奏)

CHI-CHI-BA-BA-BA CHI-CHI-CHI-BA-BA-BA
CHI-CHI-BA-BA-BA CHI-CHI-CHI-BA-BA-BA
CHI-CHI-BA-BA-BA シャチスプラッシュ!
やんべー!べー!ベー!やんべー!べー!ベー!ベー!(フー!)

銚子灯台の風 帽子おさえながら
登る朝日を感じる 魚たちがうたう

九十九里浜を駆け抜け
夢とリズムみえる

一緒に踊ろう約束ね(ね!)
やさしく咲く 菜の花の香りこころ弾む

いつでもね ちかくにね
聞こえるよサンバ
チバケンサンバ(おれ!)
魅惑ひろがる甘い千葉の梨 サンバのリズムで
海鮮はここにある!ラーメンも待っている べー
チバケンサンバ~(オレ!)

-`,
  "僕たちの英語物語": `僕達の 夢語り（ゆめがたり）

世界中を巡って 新しい出会いが待ってる
うまくいかないことだって あるけど気にしてられない

チョコを 貯めて 力を合わせて つなげた未来へ向かって
キミと 一緒に こんなところでは 負けるわけにはいかないんだから

英語物語
みんなでつくる物語
英語物語
僕達の 夢語り（ゆめがたり）

英語物語 英語物語
僕達は やれるんだから

英語物語
みんなでつくる物語
英語物語
僕達の 夢語り（ゆめかたり）`,
  "僕らは戸定建設員": `陽が昇り 始まるぞ 素晴らしい日だ
輝く汗は全部 夢へとつながる

はい！Yes！はい！Yes！
「力を合わせて！」
はい！Yes！はい！Yes！
監督の声が 胸に響くんだ

「安全は？」第一に 「休憩は？」一分だ
「給料は？」いらないよ 笑顔でいくぞ
僕らは 戸定建設員

お昼だぞ ご飯だぞ 素晴らしい日だ
飯テロ配信で おなかはペコペコ

はい！Yes！はい！Yes！
「たくさん食べよう！」
はい！Yes！はい！Yes！
監督の声が 胸に響くんだ

「千葉県は？」素敵だよ 「松戸市は？」素敵だね
「監督は？」かわいいよ 笑顔でいくぞ
僕らは 戸定建設員

「みんながいれば何でもできる そう思わせてくれるんだ」
「もしも悲しみで迷子になったら 手をつないで歩いて行こう？」（オー！）
「みんなのことが大好きだ！」（オー！）

「安全は？」第一に 「休憩は？」一分だ
「給料は？」いらないよ 笑顔でいくぞ

「千葉県は？」素敵だよ 「松戸市は？」素敵だね
「監督は？」かわいいよ 笑顔でいくぞ

僕らは戸定建設員 無敵の 戸定建設員
働くぞ！（オー！） 残業だ！（オー！）`
} as const;

export type LyricsKey = keyof typeof lyrics;

export type LyricsRuleV1 = {
  keyword: string;
  key: LyricsKey;
  title?: string;
};

export const lyricsRules = [
  {"keyword": "Yume no Tojou", "key": "Yume no Tojou"},
  {"keyword": "僕らは戸定建設員", "key": "僕らは戸定建設員"},
  {"keyword": "チバケンサンバ", "key": "チバケンサンバ"},
  {"keyword": "chibakensamba", "key": "チバケンサンバ", title: "チバケンサンバ"},
  {"keyword": "僕たちの英語物語", "key": "僕たちの英語物語"}
] as const satisfies readonly LyricsRuleV1[];